Repository: andrellopes/aChessTime
Catalog: lib/l10n/app_*.arb
Languages: it

source: Close
it: Chiudi

source: Cancel
it: Annulla

source: Save
it: Salva

source: Save and Close
it: Salva e Chiudi

source: Settings
it: Impostazioni

source: About
it: Informazioni

# resetConfirm
source: Do you really want to reset the game?
it: Vuoi davvero resettare la partita?

source: Confirm
it: Conferma

source: Tap to Start
it: Tocca per Iniziare

source: Game Over
it: Partita Terminata

source: Victory!
it: Vittoria!

source: Player 1
it: Giocatore 1

source: Player 2
it: Giocatore 2

source: Winner
it: Vincitore

# whitePlayer
source: White
it: Bianco

# blackPlayer
source: Black
it: Nero

source: Turn of
it: Turno di

source: won!
it: vinto!

source: Play
it: Gioca

source: Pause
it: Pausa

source: Reset
it: Resetta

source: Swap Colors
it: Scambia Colori

source: Quick Settings
it: Impostazioni Rapide

source: Options
it: Opzioni

# settingsTitle
source: Settings
it: Impostazioni

source: Appearance
it: Aspetto

source: Language
it: Lingua

source: Game Settings
it: Impostazioni di Gioco

source: Time Controls
it: Controlli Tempo

source: Sounds
it: Suoni

source: Other
it: Altro

source: Help
it: Aiuto

source: Dark Mode
it: Modalità Scura

# darkModeSubtitle
source: Dark theme interface
it: Interfaccia tema scuro

# soundsSubtitle
source: Sounds during game
it: Suoni durante il gioco

source: Vibration
it: Vibrazione

# vibrationSubtitle
source: Vibrate when switching turns
it: Vibra quando cambi turno

source: Player 1 starts as white
it: Il giocatore 1 inizia come bianco

source: Initial Time
it: Tempo Iniziale

source: Increment
it: Incremento

source: Time Preset
it: Preset Tempo

source: Time Presets
it: Preset Tempo

source: Custom
it: Personalizzato

source: Immersive Mode
it: Modalità Immersiva

# immersiveModeSubtitle
source: Hide system bars for full screen
it: Nascondi le barre di sistema per schermo intero

# presetTournament
source: Tournament
it: Torneo

# presetRapid
source: Rapid
it: Rapido

# presetClassical
source: Classical
it: Classico

# presetLong
source: Long Game
it: Partita Lunga

# presetBasic
source: Basic
it: Base

source: Create Custom Preset
it: Crea Preset Personalizzato

source: Edit Preset
it: Modifica Preset

source: Preset Name
it: Nome Preset

source: Preset created
it: Preset creato

source: Preset updated
it: Preset aggiornato

source: Preset deleted
it: Preset eliminato

# deletePresetConfirm
source: Delete preset
it: Elimina preset

source: Create
it: Crea

source: Edit
it: Modifica

source: Delete
it: Elimina

# aboutTitle
source: About a Chess Time
it: Informazioni su a Chess Time

# aboutContactLinks
source: Contact & Links
it: Contatto & Link

# aboutSupportMessage
source: Support the development of this app!
it: Sostieni lo sviluppo di questa app!

# aboutSupportWithPix
source: Support with PIX
it: Sostieni con PIX

# aboutPixCopied
source: PIX key copied to clipboard!
it: Chiave PIX copiata negli appunti!

# developedBy
source: Developed by Andr√© Lopes
it: Sviluppato da André Lopes

# resetTooltip
source: Reset game
it: Resetta partita

# swapTooltip
source: Swap player colors
it: Scambia colori giocatori

# settingsTooltip
source: Settings
it: Impostazioni

# aboutTooltip
source: About
it: Informazioni

source: Advanced Settings
it: Impostazioni Avanzate

# evaluateInPlayStore
source: Rate on Play Store
it: Valuta su Play Store

source: Share
it: Condividi

# aboutApp
source: About the App
it: Informazioni sull'App

# linkCopied
source: Link copied to clipboard!
it: Link copiato negli appunti!

# shareMessage
source: Check out ChessTime - a simple and modern chess timer!
it: Scopri ChessTime - un cronometro scacchi semplice e moderno!

source: Minutes
it: Minuti

source: Seconds
it: Secondi

# minutesUnit
source: {count} minutes
it: {count} minuti

# secondsUnit
source: {count} seconds
it: {count} secondi

# playerWon
source: won!
it: vinto!

source: Moves
it: Mosse

# victoryMessage
source: {winnerName} won!
it: {winnerName} vinto!

# fontSizeTitle
source: Font size of timer
it: Dimensione font del timer

# fontSizeSubtitle
source: Adjust for better visibility
it: Regola per migliore visibilità

# themeTitle
source: Theme
it: Tema

# themeSubtitle
source: Choose app appearance
it: Scegli aspetto app

# themeClassicDark
source: Classic Dark
it: Classico Scuro

# themeTraditionalBoard
source: Traditional Board
it: Scacchiera Tradizionale

# themeGreenFocus
source: Green Focus
it: Verde Concentrazione

# themeTournamentBlue
source: Tournament Blue
it: Blu Torneo

# themeRoyalGold
source: Royal Gold
it: Oro Reale

# themeGrandmasterPurple
source: Grandmaster Purple
it: Viola Gran Maestro

# themeCompetitiveRed
source: Competitive Red
it: Rosso Competitivo

# themeDeepOcean
source: Deep Ocean
it: Oceano Profondo

# themeMysticForest
source: Mystic Forest
it: Foresta Mistica

# themeElegantRose
source: Elegant Rose
it: Rosa Elegante

# themePremiumSilver
source: Premium Silver
it: Argento Premium

# themeAuroraBoreal
source: Aurora Boreal
it: Aurora Boreale

# themeCustom
source: Custom
it: Personalizzato

# premiumThemeRequired
source: Premium Theme - Upgrade required
it: Tema Premium - Aggiornamento richiesto

source: Unlock premium themes
it: Sblocca temi premium

# premiumThemesDescription
source: Unlock exclusive themes and remove ads with Pro version
it: Sblocca temi esclusivi e rimuovi annunci con versione Pro

# proFeature1
source: Access to 8 exclusive themes
it: Accesso a 8 temi esclusivi

# proFeature2
source: Themes optimized for productivity
it: Temi ottimizzati per produttività

# proFeature3
source: Remove ads
it: Rimuovi annunci

# proFeature4
source: Support app development
it: Sostieni sviluppo app

# proFeature5
source: Future updates included
it: Aggiornamenti futuri inclusi

source: Buy Pro
it: Compra Pro

# purchaseFor
source: Purchase for {price}
it: Compra per {price}

source: Processing...
it: Elaborazione...

source: Unavailable
it: Non disponibile

source: Restore Purchases
it: Ripristina Acquisti

# upgradeToProTitle
source: Upgrade to Pro
it: Aggiorna a Pro

# upgradeToProSubtitle
source: 8 premium themes + ad-free
it: 8 temi premium + senza annunci

source: Statistics
it: Statistiche

# statisticsTitle
source: Statistics
it: Statistiche

source: General Summary
it: Riepilogo Generale

source: Total Games
it: Totale Partite

source: White Wins
it: Vittorie Bianche

source: Black Wins
it: Vittorie Nere

source: Draws
it: Pareggi

# timeoutGames
source: By Timeout
it: Per Timeout

# manualGames
source: Manual Finishes
it: Terminazioni Manuali

source: Total Time
it: Tempo Totale

source: Average Duration
it: Durata Media

source: Win Rate
it: Tasso Vittorie

source: Recent Games
it: Partite Recenti

source: No games found
it: Nessuna partita trovata

source: Clear Statistics
it: Cancella Statistiche

# clearStatisticsConfirm
source: Are you sure you want to delete all statistics? This action cannot be undone.
it: Sei sicuro di voler eliminare tutte le statistiche? Questa azione non può essere annullata.

# deleteStatistics
source: Delete
it: Elimina

# statisticsCleared
source: Statistics cleared successfully
it: Statistiche cancellate con successo

source: Error loading statistics
it: Errore caricamento statistiche

# errorLoadingStatisticsWithMessage
source: Error loading statistics: {message}
it: Errore caricamento statistiche: {message}

source: Today
it: Oggi

source: Yesterday
it: Ieri

source: days ago
it: giorni fa

source: Draw
it: Pareggio

source: White wins (timeout)
it: Bianchi vincono (timeout)

source: Black wins (timeout)
it: Neri vincono (timeout)

# whiteWinsManual
source: White wins
it: Bianchi vincono

# blackWinsManual
source: Black wins
it: Neri vincono

source: View Statistics
it: Visualizza Statistiche

# statisticsSubtitle
source: Game history and detailed statistics
it: Storico partite e statistiche dettagliate

source: Finish Game
it: Termina Partita

source: White Victory
it: Vittoria Bianchi

source: Black Victory
it: Vittoria Neri

# drawGame
source: Draw
it: Pareggio

source: Agreement between players
it: Accordo tra giocatori

source: Continue Game
it: Continua Partita

source: Loading ad...
it: Caricamento annuncio...

source: Debug Pro Mode
it: Modalità Debug Pro

# debugProModeSubtitle
source: Activate Pro for testing
it: Attiva Pro per test

source: Resume game
it: Riprendi partita

source: Product not found
it: Prodotto non trovato

source: Purchase error
it: Errore acquisto

source: Restore
it: Ripristina

source: Create Backup
it: Crea Backup

# createBackupSubtitle
source: Save all app data
it: Salva tutti i dati dell'app

source: Restore Backup
it: Ripristina Backup

# restoreBackupSubtitle
source: Load data from backup file
it: Carica dati da un file di backup

# backupCreated
source: Backup created successfully
it: Backup creato

# backupCreatedMessage
source: The backup was created and saved in the Downloads folder
it: Il backup è stato creato e salvato nella cartella Download

# backupRestored
source: Backup restored successfully
it: Backup ripristinato

# backupError
source: Error creating backup
it: Errore Backup

# backupRestoreError
source: Restore Error
it: Errore Ripristino

# backupSubtitle
source: Save settings and statistics
it: Backup

# restoreSubtitle
source: Load previously saved backup
it: Ripristina

# restoreError
source: Error restoring backup
it: Errore di ripristino

# backupFileInvalid
source: Invalid backup file
it: File di backup non valido

source: Backup version incompatible
it: Versione backup non compatibile

# exportStatistics
source: Export CSV
it: Esporta CSV

# exportStatisticsSubtitle
source: Save game data to CSV
it: Salva dati di gioco in CSV

# exportCsvShareText
source: ChessTime Statistics
it: Statistiche ChessTime

# exportCsvShareSubject
source: Detailed ChessTime game statistics in CSV format
it: Statistiche dettagliate delle partite ChessTime in formato CSV

# exportCsvSuccess
source: Statistics exported successfully!
it: Statistiche esportate con successo!

# exportCsvNoData
source: No statistics to export or export error.
it: Nessuna statistica da esportare o errore nell'esportazione.

# exportCsvError
source: Error exporting statistics: {error}
it: Errore durante l'esportazione delle statistiche: {error}

# restoreBackupConfirmMessage
source: This action will replace all current data. Do you want to continue?
it: Questa azione sostituirà tutti i dati attuali. Vuoi continuare?

# csvHeader
source: Date/Time,Result Type,Winner,Game Duration,White Time Remaining,Black Time Remaining,White Moves,Black Moves,Initial Time,Increment
it: Data/Ora,Tipo di Risultato,Vincitore,Durata della Partita,Tempo Rimasto Bianco,Tempo Rimasto Nero,Mosse Bianco,Mosse Nero,Tempo Iniziale,Incremento

# backupShareTitle
source: ChessTime Backup
it: Backup ChessTime

# backupShareSubject
source: Backup of ChessTime settings and statistics
it: Backup delle impostazioni e statistiche di ChessTime

# backupNoFileSelected
source: No file selected
it: Nessun file selezionato

# backupInvalidFile
source: Invalid file
it: File non valido

# backupValidationError
source: Unknown validation error
it: Errore di validazione sconosciuto

# backupRestoreSuccess
source: Backup restored successfully
it: Backup ripristinato con successo

# backupRestoreErrorWithMessage
source: Error restoring backup: {error}
it: Errore durante il ripristino del backup: {error}

# backupVersionNotFound
source: Invalid backup file: version not found
it: File di backup non valido: versione non trovata

# backupVersionIncompatibleWithDetails
source: Backup version incompatible. Expected: {expected}, found: {found}
it: Versione del backup incompatibile. Atteso: {expected}, trovato: {found}

# backupRequiredFieldMissing
source: Invalid backup file: required field "{field}" not found
it: File di backup non valido: campo obbligatorio "{field}" non trovato
